In [2]:
import numpy as np
import pandas as pd
import pylab as pl
import matplotlib.pyplot as plt
plt.style.use('ggplot')
%matplotlib inline
import seaborn as sns

In [4]:
nan_values = ['NO CLUE', 'N/A', '0', 'non-null', 'NaN']

df = pd.read_csv('C:/Users/Len/Downloads/DATA-ANALYSYS_2-master (1)/DATA-ANALYSYS_2-master/Dataset/titanic.csv', 
                 delimiter=',', na_values=nan_values)

print(df.shape) 
print(df.info())

(887, 8)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
Survived                   342 non-null float64
Pclass                     887 non-null int64
Name                       887 non-null object
Sex                        887 non-null object
Age                        887 non-null float64
Siblings/Spouses Aboard    283 non-null float64
Parents/Children Aboard    213 non-null float64
Fare                       872 non-null float64
dtypes: float64(5), int64(1), object(2)
memory usage: 55.6+ KB
None

In [5]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,NaN,3,Mr. Owen Harris Braund,male,22.0,1.0,NaN,7.2500
1,1.0,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1.0,NaN,71.2833
2,1.0,3,Miss. Laina Heikkinen,female,26.0,NaN,NaN,7.9250
3,1.0,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1.0,NaN,53.1000
4,NaN,3,Mr. William Henry Allen,male,35.0,NaN,NaN,8.0500

In [6]:
df.describe()

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,342.0,887.000000,887.000000,283.000000,213.000000,872.000000
mean,1.0,2.305524,29.471443,1.646643,1.596244,32.861133
std,0.0,0.836662,14.121908,1.407508,0.882954,50.026480
min,1.0,1.000000,0.420000,1.000000,1.000000,4.012500
25%,1.0,2.000000,20.250000,1.000000,1.000000,7.925000
50%,1.0,3.000000,28.000000,1.000000,1.000000,14.500000
75%,1.0,3.000000,38.000000,2.000000,2.000000,31.275000
max,1.0,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
categorical_columns = [c for c in df.columns if df[c].dtype.name == 'object']
numerical_columns   = [c for c in df.columns if df[c].dtype.name != 'object']
print(categorical_columns)
print(numerical_columns)

['Name', 'Sex']
['Survived', 'Pclass', 'Age', 'Siblings/Spouses Aboard', 'Parents/Children Aboard', 'Fare']

In [13]:
df[categorical_columns].describe()

                              Name   Sex
count                          887   887
unique                         887     2
top     Mr. Charles Duane Williams  male
freq                             1   573

In [14]:
df.count(axis=0)

Survived                   342
Pclass                     887
Name                       887
Sex                        887
Age                        887
Siblings/Spouses Aboard    283
Parents/Children Aboard    213
Fare                       872
dtype: int64

In [16]:
df = df.fillna(df.median(axis=0), axis=0)

In [17]:
df.count(axis=0)

Survived                   887
Pclass                     887
Name                       887
Sex                        887
Age                        887
Siblings/Spouses Aboard    887
Parents/Children Aboard    887
Fare                       887
dtype: int64

In [19]:
data_describe = df.describe(include=[object])
for c in categorical_columns:
    df[c] = df[c].fillna(data_describe[c]['top'])

In [20]:
df.describe(include=[object])

                              Name   Sex
count                          887   887
unique                         887     2
top     Mr. Charles Duane Williams  male
freq                             1   573

In [21]:
df.describe()

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.0,887.000000,887.000000,887.000000,887.000000,887.000000
mean,1.0,2.305524,29.471443,1.206313,1.143179,32.550629
std,0.0,0.836662,14.121908,0.849409,0.501483,49.657727
min,1.0,1.000000,0.420000,1.000000,1.000000,4.012500
25%,1.0,2.000000,20.250000,1.000000,1.000000,7.925000
50%,1.0,3.000000,28.000000,1.000000,1.000000,14.500000
75%,1.0,3.000000,38.000000,1.000000,1.000000,31.137500
max,1.0,3.000000,80.000000,8.000000,6.000000,512.329200

In [23]:
binary_columns    = [c for c in categorical_columns if data_describe[c]['unique'] == 2]
nonbinary_columns = [c for c in categorical_columns if data_describe[c]['unique'] > 2]
print(binary_columns, nonbinary_columns)

['Sex'] ['Name']

In [24]:
print(df)

     Survived  Pclass                                               Name  \
0         1.0       3                             Mr. Owen Harris Braund
1         1.0       1  Mrs. John Bradley (Florence Briggs Thayer) Cum...
2         1.0       3                              Miss. Laina Heikkinen
3         1.0       1        Mrs. Jacques Heath (Lily May Peel) Futrelle
4         1.0       3                            Mr. William Henry Allen
..        ...     ...                                                ...
882       1.0       2                               Rev. Juozas Montvila
883       1.0       1                        Miss. Margaret Edith Graham
884       1.0       3                     Miss. Catherine Helen Johnston
885       1.0       1                               Mr. Karl Howell Behr
886       1.0       3                                 Mr. Patrick Dooley

        Sex   Age  Siblings/Spouses Aboard  Parents/Children Aboard     Fare
0      male  22.0                      1.0                      1.0   7.2500
1    female  38.0                      1.0                      1.0  71.2833
2    female  26.0                      1.0                      1.0   7.9250
3    female  35.0                      1.0                      1.0  53.1000
4      male  35.0                      1.0                      1.0   8.0500
..      ...   ...                      ...                      ...      ...
882    male  27.0                      1.0                      1.0  13.0000
883  female  19.0                      1.0                      1.0  30.0000
884  female   7.0                      1.0                      2.0  23.4500
885    male  26.0                      1.0                      1.0  30.0000
886    male  32.0                      1.0                      1.0   7.7500

[887 rows x 8 columns]

In [37]:
x=df[['Pclass',  'Age', 'Fare']]
y=df['Survived']
y=y.astype('int')

In [38]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size=0.3)

In [39]:
from sklearn.tree import DecisionTreeClassifier
tree=DecisionTreeClassifier(max_depth=5)
tree.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=5,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [40]:
from sklearn.tree import export_graphviz

import subprocess
import pydot 

export_graphviz(tree, out_file='C:/Users/Len/Desktop/DataAnalysis/titanic_tree.dot', 
               rounded = True, proportion = False, 
                precision = 2, filled = True)


(graph, ) = pydot.graph_from_dot_file('C:/Users/Len/Desktop/DataAnalysis/titanic_tree.dot')

graph.write_png('C:/Users/Len/Desktop/DataAnalysis/titanic_tree.png')